hpmicro/hpm_sdk/soc/HPM6280/hpm_csr_regs.h
/*
 * Copyright (c) 2021-2023 HPMicro
 *
 * SPDX-License-Identifier: BSD-3-Clause
 *
 */


#ifndef HPM_CSR_H
#define HPM_CSR_H

/* STANDARD CRS address definition */
#define CSR_USTATUS (0x0)
#define CSR_UIE (0x4)
#define CSR_UTVEC (0x5)
#define CSR_USCRATCH (0x40)
#define CSR_UEPC (0x41)
#define CSR_UCAUSE (0x42)
#define CSR_UTVAL (0x43)
#define CSR_UIP (0x44)
#define CSR_SSTATUS (0x100)
#define CSR_SEDELEG (0x102)
#define CSR_SIDELEG (0x103)
#define CSR_SIE (0x104)
#define CSR_STVEC (0x105)
#define CSR_SSCRATCH (0x140)
#define CSR_SEPC (0x141)
#define CSR_SCAUSE (0x142)
#define CSR_STVAL (0x143)
#define CSR_SIP (0x144)
#define CSR_SATP (0x180)
#define CSR_MSTATUS (0x300)
#define CSR_MISA (0x301)
#define CSR_MEDELEG (0x302)
#define CSR_MIDELEG (0x303)
#define CSR_MIE (0x304)
#define CSR_MTVEC (0x305)
#define CSR_MCOUNTEREN (0x306)
#define CSR_MHPMEVENT3 (0x323)
#define CSR_MHPMEVENT4 (0x324)
#define CSR_MHPMEVENT5 (0x325)
#define CSR_MHPMEVENT6 (0x326)
#define CSR_MSCRATCH (0x340)
#define CSR_MEPC (0x341)
#define CSR_MCAUSE (0x342)
#define CSR_MTVAL (0x343)
#define CSR_MIP (0x344)
#define CSR_PMPCFG0 (0x3A0)
#define CSR_PMPCFG1 (0x3A1)
#define CSR_PMPCFG2 (0x3A2)
#define CSR_PMPCFG3 (0x3A3)
#define CSR_PMPADDR0 (0x3B0)
#define CSR_PMPADDR1 (0x3B1)
#define CSR_PMPADDR2 (0x3B2)
#define CSR_PMPADDR3 (0x3B3)
#define CSR_PMPADDR4 (0x3B4)
#define CSR_PMPADDR5 (0x3B5)
#define CSR_PMPADDR6 (0x3B6)
#define CSR_PMPADDR7 (0x3B7)
#define CSR_PMPADDR8 (0x3B8)
#define CSR_PMPADDR9 (0x3B9)
#define CSR_PMPADDR10 (0x3BA)
#define CSR_PMPADDR11 (0x3BB)
#define CSR_PMPADDR12 (0x3BC)
#define CSR_PMPADDR13 (0x3BD)
#define CSR_PMPADDR14 (0x3BE)
#define CSR_PMPADDR15 (0x3BF)
#define CSR_TSELECT (0x7A0)
#define CSR_TDATA1 (0x7A1)
#define CSR_MCONTROL (0x7A1)
#define CSR_ICOUNT (0x7A1)
#define CSR_ITRIGGER (0x7A1)
#define CSR_ETRIGGER (0x7A1)
#define CSR_TDATA2 (0x7A2)
#define CSR_TDATA3 (0x7A3)
#define CSR_TEXTRA (0x7A3)
#define CSR_TINFO (0x7A4)
#define CSR_TCONTROL (0x7A5)
#define CSR_MCONTEXT (0x7A8)
#define CSR_SCONTEXT (0x7AA)
#define CSR_DCSR (0x7B0)
#define CSR_DPC (0x7B1)
#define CSR_DSCRATCH0 (0x7B2)
#define CSR_DSCRATCH1 (0x7B3)
#define CSR_MCYCLE (0xB00)
#define CSR_MINSTRET (0xB02)
#define CSR_MHPMCOUNTER3 (0xB03)
#define CSR_MHPMCOUNTER4 (0xB04)
#define CSR_MHPMCOUNTER5 (0xB05)
#define CSR_MHPMCOUNTER6 (0xB06)
#define CSR_MCYCLEH (0xB80)
#define CSR_MINSTRETH (0xB82)
#define CSR_MHPMCOUNTER3H (0xB83)
#define CSR_MHPMCOUNTER4H (0xB84)
#define CSR_MHPMCOUNTER5H (0xB85)
#define CSR_MHPMCOUNTER6H (0xB86)
#define CSR_PMACFG0 (0xBC0)
#define CSR_PMACFG1 (0xBC1)
#define CSR_PMACFG2 (0xBC2)
#define CSR_PMACFG3 (0xBC3)
#define CSR_PMAADDR0 (0xBD0)
#define CSR_PMAADDR1 (0xBD1)
#define CSR_PMAADDR2 (0xBD2)
#define CSR_PMAADDR3 (0xBD3)
#define CSR_PMAADDR4 (0xBD4)
#define CSR_PMAADDR5 (0xBD5)
#define CSR_PMAADDR6 (0xBD6)
#define CSR_PMAADDR7 (0xBD7)
#define CSR_PMAADDR8 (0xBD8)
#define CSR_PMAADDR9 (0xBD9)
#define CSR_PMAADDR10 (0xBDA)
#define CSR_PMAADDR11 (0xBDB)
#define CSR_PMAADDR12 (0xBDC)
#define CSR_PMAADDR13 (0xBDD)
#define CSR_PMAADDR14 (0xBDE)
#define CSR_PMAADDR15 (0xBDF)
#define CSR_CYCLE (0xC00)
#define CSR_CYCLEH (0xC80)
#define CSR_MVENDORID (0xF11)
#define CSR_MARCHID (0xF12)
#define CSR_MIMPID (0xF13)
#define CSR_MHARTID (0xF14)

/* NON-STANDARD CRS address definition */
#define CSR_SCOUNTEREN (0x106)
#define CSR_MCOUNTINHIBIT (0x320)
#define CSR_MILMB (0x7C0)
#define CSR_MDLMB (0x7C1)
#define CSR_MECC_CODE (0x7C2)
#define CSR_MNVEC (0x7C3)
#define CSR_MXSTATUS (0x7C4)
#define CSR_MPFT_CTL (0x7C5)
#define CSR_MHSP_CTL (0x7C6)
#define CSR_MSP_BOUND (0x7C7)
#define CSR_MSP_BASE (0x7C8)
#define CSR_MDCAUSE (0x7C9)
#define CSR_MCACHE_CTL (0x7CA)
#define CSR_MCCTLBEGINADDR (0x7CB)
#define CSR_MCCTLCOMMAND (0x7CC)
#define CSR_MCCTLDATA (0x7CD)
#define CSR_MCOUNTERWEN (0x7CE)
#define CSR_MCOUNTERINTEN (0x7CF)
#define CSR_MMISC_CTL (0x7D0)
#define CSR_MCOUNTERMASK_M (0x7D1)
#define CSR_MCOUNTERMASK_S (0x7D2)
#define CSR_MCOUNTERMASK_U (0x7D3)
#define CSR_MCOUNTEROVF (0x7D4)
#define CSR_MSLIDELEG (0x7D5)
#define CSR_MCLK_CTL (0x7DF)
#define CSR_DEXC2DBG (0x7E0)
#define CSR_DDCAUSE (0x7E1)
#define CSR_UITB (0x800)
#define CSR_UCODE (0x801)
#define CSR_UDCAUSE (0x809)
#define CSR_UCCTLBEGINADDR (0x80B)
#define CSR_UCCTLCOMMAND (0x80C)
#define CSR_SLIE (0x9C4)
#define CSR_SLIP (0x9C5)
#define CSR_SDCAUSE (0x9C9)
#define CSR_SCCTLDATA (0x9CD)
#define CSR_SCOUNTERINTEN (0x9CF)
#define CSR_SCOUNTERMASK_M (0x9D1)
#define CSR_SCOUNTERMASK_S (0x9D2)
#define CSR_SCOUNTERMASK_U (0x9D3)
#define CSR_SCOUNTEROVF (0x9D4)
#define CSR_SCOUNTINHIBIT (0x9E0)
#define CSR_SHPMEVENT3 (0x9E3)
#define CSR_SHPMEVENT4 (0x9E4)
#define CSR_SHPMEVENT5 (0x9E5)
#define CSR_SHPMEVENT6 (0x9E6)
#define CSR_MICM_CFG (0xFC0)
#define CSR_MDCM_CFG (0xFC1)
#define CSR_MMSC_CFG (0xFC2)
#define CSR_MMSC_CFG2 (0xFC3)

/* STANDARD CRS register bitfiled definitions */

/* Bitfield definition for register: USTATUS */
/*
 * UPIE (RW)
 *
 * UPIE holds the value of the UIE bit prior to a trap.
 */
#define CSR_USTATUS_UPIE_MASK (0x10U)
#define CSR_USTATUS_UPIE_SHIFT (4U)
#define CSR_USTATUS_UPIE_SET(x) (((uint32_t)(x) << CSR_USTATUS_UPIE_SHIFT) & CSR_USTATUS_UPIE_MASK)
#define CSR_USTATUS_UPIE_GET(x) (((uint32_t)(x) & CSR_USTATUS_UPIE_MASK) >> CSR_USTATUS_UPIE_SHIFT)

/*
 * UIE (RW)
 *
 * U mode interrupt enable bit.
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_USTATUS_UIE_MASK (0x1U)
#define CSR_USTATUS_UIE_SHIFT (0U)
#define CSR_USTATUS_UIE_SET(x) (((uint32_t)(x) << CSR_USTATUS_UIE_SHIFT) & CSR_USTATUS_UIE_MASK)
#define CSR_USTATUS_UIE_GET(x) (((uint32_t)(x) & CSR_USTATUS_UIE_MASK) >> CSR_USTATUS_UIE_SHIFT)

/* Bitfield definition for register: UIE */
/*
 * UEIE (RW)
 *
 * U mode external interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_UIE_UEIE_MASK (0x100U)
#define CSR_UIE_UEIE_SHIFT (8U)
#define CSR_UIE_UEIE_SET(x) (((uint32_t)(x) << CSR_UIE_UEIE_SHIFT) & CSR_UIE_UEIE_MASK)
#define CSR_UIE_UEIE_GET(x) (((uint32_t)(x) & CSR_UIE_UEIE_MASK) >> CSR_UIE_UEIE_SHIFT)

