hpmicro/hpm_sdk/soc/HPM6280/hpm_csr_regs.h
/*
 * SAF (RW)
 *
 * SAF indicates whether a Store/AMO Access Fault exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_SAF_MASK (0x80U)
#define CSR_SEDELEG_SAF_SHIFT (7U)
#define CSR_SEDELEG_SAF_SET(x) (((uint32_t)(x) << CSR_SEDELEG_SAF_SHIFT) & CSR_SEDELEG_SAF_MASK)
#define CSR_SEDELEG_SAF_GET(x) (((uint32_t)(x) & CSR_SEDELEG_SAF_MASK) >> CSR_SEDELEG_SAF_SHIFT)

/*
 * SAM (RW)
 *
 * SAM indicates whether a Store/AMO Address Misaligned exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_SAM_MASK (0x40U)
#define CSR_SEDELEG_SAM_SHIFT (6U)
#define CSR_SEDELEG_SAM_SET(x) (((uint32_t)(x) << CSR_SEDELEG_SAM_SHIFT) & CSR_SEDELEG_SAM_MASK)
#define CSR_SEDELEG_SAM_GET(x) (((uint32_t)(x) & CSR_SEDELEG_SAM_MASK) >> CSR_SEDELEG_SAM_SHIFT)

/*
 * LAF (RW)
 *
 * LAF indicates whether a Load Access Fault exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_LAF_MASK (0x20U)
#define CSR_SEDELEG_LAF_SHIFT (5U)
#define CSR_SEDELEG_LAF_SET(x) (((uint32_t)(x) << CSR_SEDELEG_LAF_SHIFT) & CSR_SEDELEG_LAF_MASK)
#define CSR_SEDELEG_LAF_GET(x) (((uint32_t)(x) & CSR_SEDELEG_LAF_MASK) >> CSR_SEDELEG_LAF_SHIFT)

/*
 * LAM (RW)
 *
 * LAM indicates whether a Load Address Misaligned exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_LAM_MASK (0x10U)
#define CSR_SEDELEG_LAM_SHIFT (4U)
#define CSR_SEDELEG_LAM_SET(x) (((uint32_t)(x) << CSR_SEDELEG_LAM_SHIFT) & CSR_SEDELEG_LAM_MASK)
#define CSR_SEDELEG_LAM_GET(x) (((uint32_t)(x) & CSR_SEDELEG_LAM_MASK) >> CSR_SEDELEG_LAM_SHIFT)

/*
 * B (RW)
 *
 * B indicates whether an exception triggered by breakpoint will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_B_MASK (0x8U)
#define CSR_SEDELEG_B_SHIFT (3U)
#define CSR_SEDELEG_B_SET(x) (((uint32_t)(x) << CSR_SEDELEG_B_SHIFT) & CSR_SEDELEG_B_MASK)
#define CSR_SEDELEG_B_GET(x) (((uint32_t)(x) & CSR_SEDELEG_B_MASK) >> CSR_SEDELEG_B_SHIFT)

/*
 * II (RW)
 *
 * II indicates whether an Illegal Instruction exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_II_MASK (0x4U)
#define CSR_SEDELEG_II_SHIFT (2U)
#define CSR_SEDELEG_II_SET(x) (((uint32_t)(x) << CSR_SEDELEG_II_SHIFT) & CSR_SEDELEG_II_MASK)
#define CSR_SEDELEG_II_GET(x) (((uint32_t)(x) & CSR_SEDELEG_II_MASK) >> CSR_SEDELEG_II_SHIFT)

/*
 * IAF (RW)
 *
 * IAF indicates whether an Instruction Access Fault exception will be delegated to U-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_IAF_MASK (0x2U)
#define CSR_SEDELEG_IAF_SHIFT (1U)
#define CSR_SEDELEG_IAF_SET(x) (((uint32_t)(x) << CSR_SEDELEG_IAF_SHIFT) & CSR_SEDELEG_IAF_MASK)
#define CSR_SEDELEG_IAF_GET(x) (((uint32_t)(x) & CSR_SEDELEG_IAF_MASK) >> CSR_SEDELEG_IAF_SHIFT)

/*
 * IAM (RW)
 *
 * IAM indicates whether an Instruction Address Misaligned exception will be delegated to U-mode..
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SEDELEG_IAM_MASK (0x1U)
#define CSR_SEDELEG_IAM_SHIFT (0U)
#define CSR_SEDELEG_IAM_SET(x) (((uint32_t)(x) << CSR_SEDELEG_IAM_SHIFT) & CSR_SEDELEG_IAM_MASK)
#define CSR_SEDELEG_IAM_GET(x) (((uint32_t)(x) & CSR_SEDELEG_IAM_MASK) >> CSR_SEDELEG_IAM_SHIFT)

/* Bitfield definition for register: SIDELEG */
/*
 * UEI (RW)
 *
 * UEI indicates whether an U-mode external interrupt will be delegated to S-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SIDELEG_UEI_MASK (0x100U)
#define CSR_SIDELEG_UEI_SHIFT (8U)
#define CSR_SIDELEG_UEI_SET(x) (((uint32_t)(x) << CSR_SIDELEG_UEI_SHIFT) & CSR_SIDELEG_UEI_MASK)
#define CSR_SIDELEG_UEI_GET(x) (((uint32_t)(x) & CSR_SIDELEG_UEI_MASK) >> CSR_SIDELEG_UEI_SHIFT)

/*
 * UTI (RW)
 *
 * UTI indicates whether an U-mode timer interrupt will be delegated to S-mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SIDELEG_UTI_MASK (0x10U)
#define CSR_SIDELEG_UTI_SHIFT (4U)
#define CSR_SIDELEG_UTI_SET(x) (((uint32_t)(x) << CSR_SIDELEG_UTI_SHIFT) & CSR_SIDELEG_UTI_MASK)
#define CSR_SIDELEG_UTI_GET(x) (((uint32_t)(x) & CSR_SIDELEG_UTI_MASK) >> CSR_SIDELEG_UTI_SHIFT)

/*
 * USI (RW)
 *
 * USI indicates whether an U-mode software interrupt will be delegated to S-mode.
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_SIDELEG_USI_MASK (0x1U)
#define CSR_SIDELEG_USI_SHIFT (0U)
#define CSR_SIDELEG_USI_SET(x) (((uint32_t)(x) << CSR_SIDELEG_USI_SHIFT) & CSR_SIDELEG_USI_MASK)
#define CSR_SIDELEG_USI_GET(x) (((uint32_t)(x) & CSR_SIDELEG_USI_MASK) >> CSR_SIDELEG_USI_SHIFT)

/* Bitfield definition for register: SIE */
/*
 * SEIE (RW)
 *
 * S mode external interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_SIE_SEIE_MASK (0x200U)
#define CSR_SIE_SEIE_SHIFT (9U)
#define CSR_SIE_SEIE_SET(x) (((uint32_t)(x) << CSR_SIE_SEIE_SHIFT) & CSR_SIE_SEIE_MASK)
#define CSR_SIE_SEIE_GET(x) (((uint32_t)(x) & CSR_SIE_SEIE_MASK) >> CSR_SIE_SEIE_SHIFT)

/*
 * UEIE (RW)
 *
 * U mode external interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_SIE_UEIE_MASK (0x100U)
#define CSR_SIE_UEIE_SHIFT (8U)
#define CSR_SIE_UEIE_SET(x) (((uint32_t)(x) << CSR_SIE_UEIE_SHIFT) & CSR_SIE_UEIE_MASK)
#define CSR_SIE_UEIE_GET(x) (((uint32_t)(x) & CSR_SIE_UEIE_MASK) >> CSR_SIE_UEIE_SHIFT)

/*
 * STIE (RW)
 *
 * S mode timer interrupt enable bit.
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_SIE_STIE_MASK (0x20U)
#define CSR_SIE_STIE_SHIFT (5U)
#define CSR_SIE_STIE_SET(x) (((uint32_t)(x) << CSR_SIE_STIE_SHIFT) & CSR_SIE_STIE_MASK)
#define CSR_SIE_STIE_GET(x) (((uint32_t)(x) & CSR_SIE_STIE_MASK) >> CSR_SIE_STIE_SHIFT)

/*
 * UTIE (RW)
 *
 * U mode timer interrupt enable bit
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_SIE_UTIE_MASK (0x10U)
#define CSR_SIE_UTIE_SHIFT (4U)
#define CSR_SIE_UTIE_SET(x) (((uint32_t)(x) << CSR_SIE_UTIE_SHIFT) & CSR_SIE_UTIE_MASK)
#define CSR_SIE_UTIE_GET(x) (((uint32_t)(x) & CSR_SIE_UTIE_MASK) >> CSR_SIE_UTIE_SHIFT)

/*
 * SSIE (RW)
 *
 * S mode software interrupt enable bit.
 * 0:Disabled
 * 1:Enabled
 */
#define CSR_SIE_SSIE_MASK (0x2U)
#define CSR_SIE_SSIE_SHIFT (1U)
#define CSR_SIE_SSIE_SET(x) (((uint32_t)(x) << CSR_SIE_SSIE_SHIFT) & CSR_SIE_SSIE_MASK)
#define CSR_SIE_SSIE_GET(x) (((uint32_t)(x) & CSR_SIE_SSIE_MASK) >> CSR_SIE_SSIE_SHIFT)

