hpmicro/hpm_sdk/soc/HPM6280/hpm_csr_regs.h
/*
 * M (RO)
 *
 * Integer Multiply/Divide extension
 */
#define CSR_MISA_M_MASK (0x1000U)
#define CSR_MISA_M_SHIFT (12U)
#define CSR_MISA_M_GET(x) (((uint32_t)(x) & CSR_MISA_M_MASK) >> CSR_MISA_M_SHIFT)

/*
 * L (RO)
 *
 * Tentatively reserved for Decimal Floating-Point extension
 */
#define CSR_MISA_L_MASK (0x800U)
#define CSR_MISA_L_SHIFT (11U)
#define CSR_MISA_L_GET(x) (((uint32_t)(x) & CSR_MISA_L_MASK) >> CSR_MISA_L_SHIFT)

/*
 * K (RO)
 *
 * Reserved
 */
#define CSR_MISA_K_MASK (0x400U)
#define CSR_MISA_K_SHIFT (10U)
#define CSR_MISA_K_GET(x) (((uint32_t)(x) & CSR_MISA_K_MASK) >> CSR_MISA_K_SHIFT)

/*
 * J (RO)
 *
 * Tentatively reserved for Dynamically Translated Languages extension
 */
#define CSR_MISA_J_MASK (0x200U)
#define CSR_MISA_J_SHIFT (9U)
#define CSR_MISA_J_GET(x) (((uint32_t)(x) & CSR_MISA_J_MASK) >> CSR_MISA_J_SHIFT)

/*
 * I (RO)
 *
 * RV32I/64I/128I base ISA
 */
#define CSR_MISA_I_MASK (0x100U)
#define CSR_MISA_I_SHIFT (8U)
#define CSR_MISA_I_GET(x) (((uint32_t)(x) & CSR_MISA_I_MASK) >> CSR_MISA_I_SHIFT)

/*
 * H (RO)
 *
 * Reserved
 */
#define CSR_MISA_H_MASK (0x80U)
#define CSR_MISA_H_SHIFT (7U)
#define CSR_MISA_H_GET(x) (((uint32_t)(x) & CSR_MISA_H_MASK) >> CSR_MISA_H_SHIFT)

/*
 * G (RO)
 *
 * Additional standard extensions present
 */
#define CSR_MISA_G_MASK (0x40U)
#define CSR_MISA_G_SHIFT (6U)
#define CSR_MISA_G_GET(x) (((uint32_t)(x) & CSR_MISA_G_MASK) >> CSR_MISA_G_SHIFT)

/*
 * F (RO)
 *
 * Single-precision floating-point extension
 * 0:none
 * 1:double+single precision / single precision
 */
#define CSR_MISA_F_MASK (0x20U)
#define CSR_MISA_F_SHIFT (5U)
#define CSR_MISA_F_GET(x) (((uint32_t)(x) & CSR_MISA_F_MASK) >> CSR_MISA_F_SHIFT)

/*
 * E (RO)
 *
 * RV32E base ISA
 */
#define CSR_MISA_E_MASK (0x10U)
#define CSR_MISA_E_SHIFT (4U)
#define CSR_MISA_E_GET(x) (((uint32_t)(x) & CSR_MISA_E_MASK) >> CSR_MISA_E_SHIFT)

/*
 * D (RO)
 *
 * Double-precision floating-point extension
 * 0:single precision / none
 * 1:double+single precision
 */
#define CSR_MISA_D_MASK (0x8U)
#define CSR_MISA_D_SHIFT (3U)
#define CSR_MISA_D_GET(x) (((uint32_t)(x) & CSR_MISA_D_MASK) >> CSR_MISA_D_SHIFT)

/*
 * C (RO)
 *
 * Compressed extension
 */
#define CSR_MISA_C_MASK (0x4U)
#define CSR_MISA_C_SHIFT (2U)
#define CSR_MISA_C_GET(x) (((uint32_t)(x) & CSR_MISA_C_MASK) >> CSR_MISA_C_SHIFT)

/*
 * B (RO)
 *
 * Tentatively reserved for Bit operations extension
 */
#define CSR_MISA_B_MASK (0x2U)
#define CSR_MISA_B_SHIFT (1U)
#define CSR_MISA_B_GET(x) (((uint32_t)(x) & CSR_MISA_B_MASK) >> CSR_MISA_B_SHIFT)

/*
 * A (RO)
 *
 * Atomic extension
 * 0:no
 * 1:yes
 */
#define CSR_MISA_A_MASK (0x1U)
#define CSR_MISA_A_SHIFT (0U)
#define CSR_MISA_A_GET(x) (((uint32_t)(x) & CSR_MISA_A_MASK) >> CSR_MISA_A_SHIFT)

/* Bitfield definition for register: MEDELEG */
/*
 * SPF (RW)
 *
 * SPF indicates whether a Store/AMO Page Fault exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_SPF_MASK (0x8000U)
#define CSR_MEDELEG_SPF_SHIFT (15U)
#define CSR_MEDELEG_SPF_SET(x) (((uint32_t)(x) << CSR_MEDELEG_SPF_SHIFT) & CSR_MEDELEG_SPF_MASK)
#define CSR_MEDELEG_SPF_GET(x) (((uint32_t)(x) & CSR_MEDELEG_SPF_MASK) >> CSR_MEDELEG_SPF_SHIFT)

/*
 * LPF (RW)
 *
 * LPF indicates whether a Load Page Fault exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_LPF_MASK (0x2000U)
#define CSR_MEDELEG_LPF_SHIFT (13U)
#define CSR_MEDELEG_LPF_SET(x) (((uint32_t)(x) << CSR_MEDELEG_LPF_SHIFT) & CSR_MEDELEG_LPF_MASK)
#define CSR_MEDELEG_LPF_GET(x) (((uint32_t)(x) & CSR_MEDELEG_LPF_MASK) >> CSR_MEDELEG_LPF_SHIFT)

/*
 * IPF (RW)
 *
 * IPF indicates whether an Instruction Page Fault exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_IPF_MASK (0x1000U)
#define CSR_MEDELEG_IPF_SHIFT (12U)
#define CSR_MEDELEG_IPF_SET(x) (((uint32_t)(x) << CSR_MEDELEG_IPF_SHIFT) & CSR_MEDELEG_IPF_MASK)
#define CSR_MEDELEG_IPF_GET(x) (((uint32_t)(x) & CSR_MEDELEG_IPF_MASK) >> CSR_MEDELEG_IPF_SHIFT)

/*
 * SEC (RW)
 *
 * SEC indicates whether an exception triggered by environment call from S-mode will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_SEC_MASK (0x200U)
#define CSR_MEDELEG_SEC_SHIFT (9U)
#define CSR_MEDELEG_SEC_SET(x) (((uint32_t)(x) << CSR_MEDELEG_SEC_SHIFT) & CSR_MEDELEG_SEC_MASK)
#define CSR_MEDELEG_SEC_GET(x) (((uint32_t)(x) & CSR_MEDELEG_SEC_MASK) >> CSR_MEDELEG_SEC_SHIFT)

/*
 * UEC (RW)
 *
 * UEC indicates whether an exception triggered by environment call from U-mode will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_UEC_MASK (0x100U)
#define CSR_MEDELEG_UEC_SHIFT (8U)
#define CSR_MEDELEG_UEC_SET(x) (((uint32_t)(x) << CSR_MEDELEG_UEC_SHIFT) & CSR_MEDELEG_UEC_MASK)
#define CSR_MEDELEG_UEC_GET(x) (((uint32_t)(x) & CSR_MEDELEG_UEC_MASK) >> CSR_MEDELEG_UEC_SHIFT)

/*
 * SAF (RW)
 *
 * SAF indicates whether a Store/AMO Access Fault exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_SAF_MASK (0x80U)
#define CSR_MEDELEG_SAF_SHIFT (7U)
#define CSR_MEDELEG_SAF_SET(x) (((uint32_t)(x) << CSR_MEDELEG_SAF_SHIFT) & CSR_MEDELEG_SAF_MASK)
#define CSR_MEDELEG_SAF_GET(x) (((uint32_t)(x) & CSR_MEDELEG_SAF_MASK) >> CSR_MEDELEG_SAF_SHIFT)

/*
 * SAM (RW)
 *
 * SAM indicates whether a Store/AMO Address Misaligned exception will be delegated to S-mode
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_SAM_MASK (0x40U)
#define CSR_MEDELEG_SAM_SHIFT (6U)
#define CSR_MEDELEG_SAM_SET(x) (((uint32_t)(x) << CSR_MEDELEG_SAM_SHIFT) & CSR_MEDELEG_SAM_MASK)
#define CSR_MEDELEG_SAM_GET(x) (((uint32_t)(x) & CSR_MEDELEG_SAM_MASK) >> CSR_MEDELEG_SAM_SHIFT)

/*
 * LAF (RW)
 *
 * LAF indicates whether a Load Access Fault exception will be delegated to S-mode.
 * 0:Not delegate
 * 1:delegate
 */
#define CSR_MEDELEG_LAF_MASK (0x20U)
#define CSR_MEDELEG_LAF_SHIFT (5U)
#define CSR_MEDELEG_LAF_SET(x) (((uint32_t)(x) << CSR_MEDELEG_LAF_SHIFT) & CSR_MEDELEG_LAF_MASK)
#define CSR_MEDELEG_LAF_GET(x) (((uint32_t)(x) & CSR_MEDELEG_LAF_MASK) >> CSR_MEDELEG_LAF_SHIFT)

