hpmicro/hpm_sdk/soc/HPM6280/hpm_csr_regs.h
/*
 * LAF (RW)
 *
 * Indicates whether Load Access Fault exceptions are redirected to enter Debug Mode.
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_DEXC2DBG_LAF_MASK (0x20U)
#define CSR_DEXC2DBG_LAF_SHIFT (5U)
#define CSR_DEXC2DBG_LAF_SET(x) (((uint32_t)(x) << CSR_DEXC2DBG_LAF_SHIFT) & CSR_DEXC2DBG_LAF_MASK)
#define CSR_DEXC2DBG_LAF_GET(x) (((uint32_t)(x) & CSR_DEXC2DBG_LAF_MASK) >> CSR_DEXC2DBG_LAF_SHIFT)

/*
 * LAM (RW)
 *
 * Indicates whether Load Access Misaligned exceptions are redirected to enter Debug Mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_DEXC2DBG_LAM_MASK (0x10U)
#define CSR_DEXC2DBG_LAM_SHIFT (4U)
#define CSR_DEXC2DBG_LAM_SET(x) (((uint32_t)(x) << CSR_DEXC2DBG_LAM_SHIFT) & CSR_DEXC2DBG_LAM_MASK)
#define CSR_DEXC2DBG_LAM_GET(x) (((uint32_t)(x) & CSR_DEXC2DBG_LAM_MASK) >> CSR_DEXC2DBG_LAM_SHIFT)

/*
 * NMI (RW)
 *
 * Indicates whether Non-Maskable Interrupt
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_DEXC2DBG_NMI_MASK (0x8U)
#define CSR_DEXC2DBG_NMI_SHIFT (3U)
#define CSR_DEXC2DBG_NMI_SET(x) (((uint32_t)(x) << CSR_DEXC2DBG_NMI_SHIFT) & CSR_DEXC2DBG_NMI_MASK)
#define CSR_DEXC2DBG_NMI_GET(x) (((uint32_t)(x) & CSR_DEXC2DBG_NMI_MASK) >> CSR_DEXC2DBG_NMI_SHIFT)

/*
 * II (RW)
 *
 * Indicates whether Illegal Instruction exceptions are redirected to enter Debug Mode.
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_DEXC2DBG_II_MASK (0x4U)
#define CSR_DEXC2DBG_II_SHIFT (2U)
#define CSR_DEXC2DBG_II_SET(x) (((uint32_t)(x) << CSR_DEXC2DBG_II_SHIFT) & CSR_DEXC2DBG_II_MASK)
#define CSR_DEXC2DBG_II_GET(x) (((uint32_t)(x) & CSR_DEXC2DBG_II_MASK) >> CSR_DEXC2DBG_II_SHIFT)

/*
 * IAF (RW)
 *
 * Indicates whether Instruction Access Fault exceptions are redirected to enter Debug Mode
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_DEXC2DBG_IAF_MASK (0x2U)
#define CSR_DEXC2DBG_IAF_SHIFT (1U)
#define CSR_DEXC2DBG_IAF_SET(x) (((uint32_t)(x) << CSR_DEXC2DBG_IAF_SHIFT) & CSR_DEXC2DBG_IAF_MASK)
#define CSR_DEXC2DBG_IAF_GET(x) (((uint32_t)(x) & CSR_DEXC2DBG_IAF_MASK) >> CSR_DEXC2DBG_IAF_SHIFT)

/*
 * IAM (RW)
 *
 * Indicates whether Instruction Access Misaligned exceptions are redirected to enter Debug Mode.
 * 0:Do not redirect
 * 1:Redirect
 */
#define CSR_DEXC2DBG_IAM_MASK (0x1U)
#define CSR_DEXC2DBG_IAM_SHIFT (0U)
#define CSR_DEXC2DBG_IAM_SET(x) (((uint32_t)(x) << CSR_DEXC2DBG_IAM_SHIFT) & CSR_DEXC2DBG_IAM_MASK)
#define CSR_DEXC2DBG_IAM_GET(x) (((uint32_t)(x) & CSR_DEXC2DBG_IAM_MASK) >> CSR_DEXC2DBG_IAM_SHIFT)

/* Bitfield definition for register: DDCAUSE */
/*
 * SUBTYPE (RO)
 *
 * Subtypes for main type.
 * The table below lists the subtypes for DCSR.CAUSE==1 and DDCAUSE.MAINTYPE==3.
 * 0:Illegal instruction
 * 1:Privileged instruction
 * 2:Non-existent CSR
 * 3:Privilege CSR access
 * 4:Read-only CSR update
 */
#define CSR_DDCAUSE_SUBTYPE_MASK (0xFF00U)
#define CSR_DDCAUSE_SUBTYPE_SHIFT (8U)
#define CSR_DDCAUSE_SUBTYPE_GET(x) (((uint32_t)(x) & CSR_DDCAUSE_SUBTYPE_MASK) >> CSR_DDCAUSE_SUBTYPE_SHIFT)

/*
 * MAINTYPE (RO)
 *
 * Cause for redirection to Debug Mode.
 * 0:Software Breakpoint (EBREAK)
 * 1:Instruction Access Misaligned (IAM)
 * 2:Instruction Access Fault (IAF)
 * 3:Illegal Instruction (II)
 * 4:Non-Maskable Interrupt (NMI)
 * 5:Load Access Misaligned (LAM)
 * 6:Load Access Fault (LAF)
 * 7:Store Access Misaligned (SAM)
 * 8:Store Access Fault (SAF)
 * 9:U-mode Environment Call (UEC)
 * 10:S-mode Environment Call (SEC)
 * 11:Instruction page fault
 * 12:M-mode Environment Call (MEC)
 * 13:Load page fault
 * 14:Reserved
 * 15:Store/AMO page fault
 * 16:Imprecise ECC error
 * 17;Bus write transaction error
 * 18:Performance Counter overflow
 * 19–31:Reserved
 * 32:Stack overflow exception
 * 33:Stack underflow exception
 * 34:ACE disabled exception
 * 35–39:Reserved
 * 40–47:ACE exception
 * ≥48:Reserved
 */
#define CSR_DDCAUSE_MAINTYPE_MASK (0xFFU)
#define CSR_DDCAUSE_MAINTYPE_SHIFT (0U)
#define CSR_DDCAUSE_MAINTYPE_GET(x) (((uint32_t)(x) & CSR_DDCAUSE_MAINTYPE_MASK) >> CSR_DDCAUSE_MAINTYPE_SHIFT)

/* Bitfield definition for register: UITB */
/*
 * ADDR (RW)
 *
 * The base address of the CoDense instruction table. This field is reserved if uitb.HW == 1.
 */
#define CSR_UITB_ADDR_MASK (0xFFFFFFFCUL)
#define CSR_UITB_ADDR_SHIFT (2U)
#define CSR_UITB_ADDR_SET(x) (((uint32_t)(x) << CSR_UITB_ADDR_SHIFT) & CSR_UITB_ADDR_MASK)
#define CSR_UITB_ADDR_GET(x) (((uint32_t)(x) & CSR_UITB_ADDR_MASK) >> CSR_UITB_ADDR_SHIFT)

/*
 * HW (RO)
 *
 * This bit specifies if the CoDense instruction table is hardwired.
 * 0:The instruction table is located in memory. uitb.ADDR should be initialized to point to the table before using the CoDense instructions.
 * 1:The instruction table is hardwired. Initialization of uitb.ADDR is not needed before using the CoDense instructions.
 */
#define CSR_UITB_HW_MASK (0x1U)
#define CSR_UITB_HW_SHIFT (0U)
#define CSR_UITB_HW_GET(x) (((uint32_t)(x) & CSR_UITB_HW_MASK) >> CSR_UITB_HW_SHIFT)

/* Bitfield definition for register: UCODE */
/*
 * OV (RW)
 *
 * Overflow flag. It will be set by DSP instructions with a saturated result.
 * 0:A saturated result is not generated
 * 1:A saturated result is generated
 */
#define CSR_UCODE_OV_MASK (0x1U)
#define CSR_UCODE_OV_SHIFT (0U)
#define CSR_UCODE_OV_SET(x) (((uint32_t)(x) << CSR_UCODE_OV_SHIFT) & CSR_UCODE_OV_MASK)
#define CSR_UCODE_OV_GET(x) (((uint32_t)(x) & CSR_UCODE_OV_MASK) >> CSR_UCODE_OV_SHIFT)

/* Bitfield definition for register: UDCAUSE */
/*
 * UDCAUSE (RW)
 *
 * This register further disambiguates causes of traps recorded in the ucause register. See the list below for details.
 * The value of UDCAUSE for precise exception:
 * When ucause == 1 (Instruction access fault)
 * 0:Reserved
 * 1:ECC/Parity error
 * 2:PMP instruction access violation
 * 3:Bus error
 * 4:PMA empty hole access
 * When ucause == 2 (Illegal instruction)
 * 0:Please parse the utval CSR
 * 1:FP disabled exception
 * 2:ACE disabled exception
 * When ucause == 5 (Load access fault)
 * 0:Reserved
 * 1:ECC/Parity error
 * 2:PMP load access violation
 * 3:Bus error
 * 4:Misaligned address
 * 5:PMA empty hole access
 * 6:PMA attribute inconsistency
 * 7:PMA NAMO exception
 * When ucause == 7 (Store access fault)
 * 0:Reserved
 * 1:ECC/Parity error
 * 2:PMP store access violation
 * 3:Bus error
 * 4:Misaligned address
 * 5:PMA empty hole access
 * 6:PMA attribute inconsistency
 * 7:PMA NAMO exception
 */
#define CSR_UDCAUSE_UDCAUSE_MASK (0x7U)
#define CSR_UDCAUSE_UDCAUSE_SHIFT (0U)
#define CSR_UDCAUSE_UDCAUSE_SET(x) (((uint32_t)(x) << CSR_UDCAUSE_UDCAUSE_SHIFT) & CSR_UDCAUSE_UDCAUSE_MASK)
#define CSR_UDCAUSE_UDCAUSE_GET(x) (((uint32_t)(x) & CSR_UDCAUSE_UDCAUSE_MASK) >> CSR_UDCAUSE_UDCAUSE_SHIFT)

