hpmicro/hpm_sdk/soc/HPM6280/hpm_csr_regs.h
/* Bitfield definition for register: UCCTLBEGINADDR */
/*
 * VA (RW)
 *
 * It is an alias to the mcctlbeginaddr register and it is only accessible to Supervisor-mode and User-mode software when mcache_ctl.CCTL_SUEN is 1. Otherwise illegal instruction exceptions will be triggered.
 */
#define CSR_UCCTLBEGINADDR_VA_MASK (0xFFFFFFFFUL)
#define CSR_UCCTLBEGINADDR_VA_SHIFT (0U)
#define CSR_UCCTLBEGINADDR_VA_SET(x) (((uint32_t)(x) << CSR_UCCTLBEGINADDR_VA_SHIFT) & CSR_UCCTLBEGINADDR_VA_MASK)
#define CSR_UCCTLBEGINADDR_VA_GET(x) (((uint32_t)(x) & CSR_UCCTLBEGINADDR_VA_MASK) >> CSR_UCCTLBEGINADDR_VA_SHIFT)

/* Bitfield definition for register: UCCTLCOMMAND */
/*
 * VA (RW)
 *
 * See User CCTL Command Definition Table
 */
#define CSR_UCCTLCOMMAND_VA_MASK (0x1FU)
#define CSR_UCCTLCOMMAND_VA_SHIFT (0U)
#define CSR_UCCTLCOMMAND_VA_SET(x) (((uint32_t)(x) << CSR_UCCTLCOMMAND_VA_SHIFT) & CSR_UCCTLCOMMAND_VA_MASK)
#define CSR_UCCTLCOMMAND_VA_GET(x) (((uint32_t)(x) & CSR_UCCTLCOMMAND_VA_MASK) >> CSR_UCCTLCOMMAND_VA_SHIFT)

/* Bitfield definition for register: SLIE */
/*
 * PMOVI (RW)
 *
 * Enable S-mode performance monitor overflow local interrupt.
 * 0:Local interrupt is not enabled.
 * 1:Local interrupt is enabled
 */
#define CSR_SLIE_PMOVI_MASK (0x40000UL)
#define CSR_SLIE_PMOVI_SHIFT (18U)
#define CSR_SLIE_PMOVI_SET(x) (((uint32_t)(x) << CSR_SLIE_PMOVI_SHIFT) & CSR_SLIE_PMOVI_MASK)
#define CSR_SLIE_PMOVI_GET(x) (((uint32_t)(x) & CSR_SLIE_PMOVI_MASK) >> CSR_SLIE_PMOVI_SHIFT)

/*
 * BWEI (RW)
 *
 * Enable S-mode bus read/write transaction error local interrupt. The processor may receive bus errors on load/store instructions or cache writebacks.
 * 0:Local interrupt is not enabled.
 * 1:Local interrupt is enabled
 */
#define CSR_SLIE_BWEI_MASK (0x20000UL)
#define CSR_SLIE_BWEI_SHIFT (17U)
#define CSR_SLIE_BWEI_SET(x) (((uint32_t)(x) << CSR_SLIE_BWEI_SHIFT) & CSR_SLIE_BWEI_MASK)
#define CSR_SLIE_BWEI_GET(x) (((uint32_t)(x) & CSR_SLIE_BWEI_MASK) >> CSR_SLIE_BWEI_SHIFT)

/*
 * IMECCI (RW)
 *
 * Enable S-mode slave-port ECC error local interrupt.
 * 0:Local interrupt is not enabled.
 * 1:Local interrupt is enabled
 */
#define CSR_SLIE_IMECCI_MASK (0x10000UL)
#define CSR_SLIE_IMECCI_SHIFT (16U)
#define CSR_SLIE_IMECCI_SET(x) (((uint32_t)(x) << CSR_SLIE_IMECCI_SHIFT) & CSR_SLIE_IMECCI_MASK)
#define CSR_SLIE_IMECCI_GET(x) (((uint32_t)(x) & CSR_SLIE_IMECCI_MASK) >> CSR_SLIE_IMECCI_SHIFT)

/* Bitfield definition for register: SLIP */
/*
 * PMOVI (RW)
 *
 * Pending control and status of S-mode performance monitor overflow local interrupt.
 * 0:Local interrupt is not enabled.
 * 1:Local interrupt is enabled
 */
#define CSR_SLIP_PMOVI_MASK (0x40000UL)
#define CSR_SLIP_PMOVI_SHIFT (18U)
#define CSR_SLIP_PMOVI_SET(x) (((uint32_t)(x) << CSR_SLIP_PMOVI_SHIFT) & CSR_SLIP_PMOVI_MASK)
#define CSR_SLIP_PMOVI_GET(x) (((uint32_t)(x) & CSR_SLIP_PMOVI_MASK) >> CSR_SLIP_PMOVI_SHIFT)

/*
 * BWEI (RW)
 *
 * Pending control and status of S-mode bus read/write transaction error local interrupt. The processor may receive bus errors on load/store instructions or cache writebacks.
 * 0:Local interrupt is not enabled.
 * 1:Local interrupt is enabled
 */
#define CSR_SLIP_BWEI_MASK (0x20000UL)
#define CSR_SLIP_BWEI_SHIFT (17U)
#define CSR_SLIP_BWEI_SET(x) (((uint32_t)(x) << CSR_SLIP_BWEI_SHIFT) & CSR_SLIP_BWEI_MASK)
#define CSR_SLIP_BWEI_GET(x) (((uint32_t)(x) & CSR_SLIP_BWEI_MASK) >> CSR_SLIP_BWEI_SHIFT)

/*
 * IMECCI (RW)
 *
 * Pending control and status of S-mode slave-port ECC error local interrupt..
 * 0:Local interrupt is not enabled.
 * 1:Local interrupt is enabled
 */
#define CSR_SLIP_IMECCI_MASK (0x10000UL)
#define CSR_SLIP_IMECCI_SHIFT (16U)
#define CSR_SLIP_IMECCI_SET(x) (((uint32_t)(x) << CSR_SLIP_IMECCI_SHIFT) & CSR_SLIP_IMECCI_MASK)
#define CSR_SLIP_IMECCI_GET(x) (((uint32_t)(x) & CSR_SLIP_IMECCI_MASK) >> CSR_SLIP_IMECCI_SHIFT)

/* Bitfield definition for register: SDCAUSE */
/*
 * PM (RW)
 *
 * When scause is imprecise exception (in the form of an interrupt), the PM field records the privileged mode of the instruction that caused the imprecise exception. The PM field encoding is defined as follows:
 * 0:User mode
 * 1:Supervisor mode
 * 2:Reserved
 * 3:Machine mode
 */
#define CSR_SDCAUSE_PM_MASK (0x60U)
#define CSR_SDCAUSE_PM_SHIFT (5U)
#define CSR_SDCAUSE_PM_SET(x) (((uint32_t)(x) << CSR_SDCAUSE_PM_SHIFT) & CSR_SDCAUSE_PM_MASK)
#define CSR_SDCAUSE_PM_GET(x) (((uint32_t)(x) & CSR_SDCAUSE_PM_MASK) >> CSR_SDCAUSE_PM_SHIFT)

/*
 * SDCAUSE (RW)
 *
 * This register further disambiguates causes of traps recorded in the scause register. See the list below for details.
 * The value of SDCAUSE for precise exception:
 *   When scause == 1 (Instruction access fault):
 *     0:Reserved; 1:ECC/Parity error; 2:PMP instruction access violation; 3:Bus error; 4:PMA empty hole access
 *   When scause == 2 (Illegal instruction):
 *     0:Please parse the stval CSR; 1:FP disabled exception; 2:ACE disabled exception
 *   When scause == 5 (Load access fault):
 *     0:Reserved; 1:ECC/Parity error; 2:PMP load access violation; 3:Bus error; 4:Misaligned address; 5:PMA empty hole access; 6:PMA attribute inconsistency; 7:PMA NAMO exception
 *   When scause == 7 (Store access fault):
 *     0:Reserved; 1:ECC/Parity error; 2:PMP load access violation; 3:Bus error; 4:Misaligned address; 5:PMA empty hole access; 6:PMA attribute inconsistency; 7:PMA NAMO exception
 * The value of SDCAUSE for imprecise exception:
 *   When scause == Local Interrupt 16 or Local Interrupt 272 (16 + 256) (ECC error local interrupt)
 *     0:Reserved; 1:LM slave port ECC/Parity error; 2:Imprecise store ECC/Parity error; 3:Imprecise load ECC/Parity error
 *   When scause == Local Interrupt 17 or Local Interrupt 273 (17 + 256) (Bus read/write transaction error local interrupt)
 *     0:Reserved; 1:Bus read error; 2:Bus write error; 3:PMP error caused by load instructions; 4:PMP error caused by store instructions; 5:PMA error caused by load instructions; 6:PMA error caused by store instructions
 */
#define CSR_SDCAUSE_SDCAUSE_MASK (0x7U)
#define CSR_SDCAUSE_SDCAUSE_SHIFT (0U)
#define CSR_SDCAUSE_SDCAUSE_SET(x) (((uint32_t)(x) << CSR_SDCAUSE_SDCAUSE_SHIFT) & CSR_SDCAUSE_SDCAUSE_MASK)
#define CSR_SDCAUSE_SDCAUSE_GET(x) (((uint32_t)(x) & CSR_SDCAUSE_SDCAUSE_MASK) >> CSR_SDCAUSE_SDCAUSE_SHIFT)

/* Bitfield definition for register: SCCTLDATA */
/*
 * VA (RW)
 *
 * See CCTL Commands Which Access mcctldata Table
 */
#define CSR_SCCTLDATA_VA_MASK (0x1FU)
#define CSR_SCCTLDATA_VA_SHIFT (0U)
#define CSR_SCCTLDATA_VA_SET(x) (((uint32_t)(x) << CSR_SCCTLDATA_VA_SHIFT) & CSR_SCCTLDATA_VA_MASK)
#define CSR_SCCTLDATA_VA_GET(x) (((uint32_t)(x) & CSR_SCCTLDATA_VA_MASK) >> CSR_SCCTLDATA_VA_SHIFT)

/* Bitfield definition for register: SCOUNTERINTEN */
/*
 * HPM6 (RW)
 *
 * See register description
 */
#define CSR_SCOUNTERINTEN_HPM6_MASK (0x40U)
#define CSR_SCOUNTERINTEN_HPM6_SHIFT (6U)
#define CSR_SCOUNTERINTEN_HPM6_SET(x) (((uint32_t)(x) << CSR_SCOUNTERINTEN_HPM6_SHIFT) & CSR_SCOUNTERINTEN_HPM6_MASK)
#define CSR_SCOUNTERINTEN_HPM6_GET(x) (((uint32_t)(x) & CSR_SCOUNTERINTEN_HPM6_MASK) >> CSR_SCOUNTERINTEN_HPM6_SHIFT)

